# Название: Автоматическая фильтрация нецелевых задач в работе аналитика бизнесс-процессов методами машинного обучения с учителем

# 1. Обзор
Цель: Сократить долю нецелевых заявок до 10%
Задачи:
- Собрать и проанализировать данные по релевантным заявкам
- Выбрать подходящие для задачи алгоритмы
- Применить алгоритмы на данных и сравнить результаты
- Предоставить итоги анализа профильной команде

# 2. Мотивация
Эта проблема важна, так как нецелевые заявки тратят рабочее время сотрудников впустую - а это сказывается на эффективности работы, что влияет на деньги компании

# 3. Метрики
ROC AUC - использую для поиска наилучшей модели
FPR - удерживаю на незначительном уровне, чтобы поймать ощутимый эффект

# 4. Требования
- Жестких требований со стороны бизнеса нет, так как в эту сторону раньше не было исследований.
В процессе разработки решения пришел к мысли установить FPR на уровне 10%, так как мы не сможем свести FP к 0, а высокий показатель будет нам дорого стоить.
- Так как сами заявки составляются живыми людьми, то есть понятный риск, что практически всегда часть заявок может быть неправильно классифицирована.
- Сложно добиться идеальной классификации заявок, так как тексты в разные моменты могут меняться и модели могут не улавливать контекст.
